{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\up202000782\Downloads\ECOLET_18_01854_replication\ECOLET_18_01854_v1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Dec 2020, 10:31:30
{txt}
{com}. 
. 
. /// Load data ///
> 
. use ECOLET_18_01854, clear //  n=2929 cities (cities with a lame-duck mayor in 2004-08 term were dropped) 
{txt}
{com}. 
. 
. /// Create key variables ///
> 
. *distance to population cutoffs
. g dist=. 
{txt}(2,929 missing values generated)

{com}. replace dist=population-70  if state!=35  // all states except Sao Paulo
{txt}(2,592 real changes made)

{com}. replace dist=population-100 if state==35  // Sao Paulo State
{txt}(337 real changes made)

{com}. lab var dist "distance to population cutoffs (in 000s residents)"
{txt}
{com}. 
. *Farmacia Popular eligibility dummy
. g fpeligible=0      
{txt}
{com}. replace fpeligible=1 if population>=100 &  state==35 & population!=.
{txt}(38 real changes made)

{com}. replace fpeligible=1 if population>=70  &  state!=35 & population!=.
{txt}(156 real changes made)

{com}. lab var fpeligible "eligible for Farmacia Popular"
{txt}
{com}. 
. *generate spline polinomial  
. g dist_fpeligible=dist*fpeligible       
{txt}
{com}.  
.  
.  
. /// Replication of Table 1 /// 
> 
. **Replication of columns 1-4**   
. 
. /* foreach bwmethod in CV IK  {c -(}
> preserve 
> rdbwselect_2014 votes_share_08 dist, c(0) p(1) kernel(tri) bwselect("`bwmethod'") 
> loc bw=round(e(h_`bwmethod'))
> drop if dist>`bw'
> drop if dist<-`bw'
> 
> *Panel A. OLS estimates
> reg votes_share_04 fpcomplier dist dist_fpeligible, r cluster(state)
> outreg2 fpcomplier using "Table1_PanelA_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
> 
> reg votes_share_08 fpcomplier dist dist_fpeligible, r cluster(state)
> outreg2 fpcomplier using "Table1_PanelA_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
> 
> 
> *Panel B. Reduced-form estimates (sharp regression discontinuity design)
> reg votes_share_04 fpeligible dist dist_fpeligible, r cluster(state)
> outreg2 fpeligible using "Table1_PanelB_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
> 
> reg votes_share_08 fpeligible dist dist_fpeligible, r cluster(state)
> outreg2 fpeligible using "Table1_PanelB_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
> 
> 
> *Panel C. 2SLS estimates (fuzzy regression discontinuity design) 
> ivreg2 votes_share_04 (fpcomplier=fpeligible) dist dist_fpeligible, r cluster(state)
> outreg2 fpcomplier using "Table1_PanelC_2SLS_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
> 
> ivreg2 votes_share_08 (fpcomplier=fpeligible) dist dist_fpeligible, r cluster(state)
> outreg2 fpcomplier using "Table1_PanelC_2SLS_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
> 
> reg fpcomplier fpeligible dist dist_fpeligible, r cluster(state) 
> outreg2 fpeligible using "Table1_PanelC_firststage_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
> 
> restore
> {c )-} */
. 
. 
. **Replication of columns 5-6**   
. 
. foreach bwmethod in cerrd  {c -(}
{txt}  2{com}. preserve 
{txt}  3{com}. rdbwselect votes_share_08 dist, c(0) p(1) kernel(tri) bwselect("`bwmethod'") 
{txt}  4{com}. loc bw=round(e(h_`bwmethod'))
{txt}  5{com}. drop if dist>`bw'
{txt}  6{com}. drop if dist<-`bw'
{txt}  7{com}. 
. *Panel A. OLS estimates
. reg votes_share_04 fpcomplier dist dist_fpeligible, r cluster(state)
{txt}  8{com}. outreg2 fpcomplier using "Table1_PanelA_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
{txt}  9{com}. 
. reg votes_share_08 fpcomplier dist dist_fpeligible, r cluster(state)
{txt} 10{com}. outreg2 fpcomplier using "Table1_PanelA_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
{txt} 11{com}. 
. 
. *Panel B. Reduced-form estimates (sharp regression discontinuity design)
. reg votes_share_04 fpeligible dist dist_fpeligible, r cluster(state)
{txt} 12{com}. outreg2 fpeligible using "Table1_PanelB_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
{txt} 13{com}. 
. reg votes_share_08 fpeligible dist dist_fpeligible, r cluster(state)
{txt} 14{com}. outreg2 fpeligible using "Table1_PanelB_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
{txt} 15{com}. 
. 
. *Panel C. 2SLS estimates (fuzzy regression discontinuity design) 
. ivreg2 votes_share_04 (fpcomplier=fpeligible) dist dist_fpeligible, r cluster(state)
{txt} 16{com}. outreg2 fpcomplier using "Table1_PanelC_2SLS_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
{txt} 17{com}. 
. ivreg2 votes_share_08 (fpcomplier=fpeligible) dist dist_fpeligible, r cluster(state)
{txt} 18{com}. outreg2 fpcomplier using "Table1_PanelC_2SLS_`bwmethod'.xls", append  se slow(1000) nocons lab dec(5) 
{txt} 19{com}. 
. reg fpcomplier fpeligible dist dist_fpeligible, r cluster(state) 
{txt} 20{com}. outreg2 fpeligible using "Table1_PanelC_firststage_`bwmethod'.xls", replace  se slow(1000) nocons lab dec(5) 
{txt} 21{com}. 
. restore
{txt} 22{com}. {c )-}
{res}
Bandwidth estimators for sharp RD local polynomial regression.

{txt}{ralign 18: Cutoff c = }{col 19} {c |} {col 21}Left of {res}c{col 33}{txt}Right of {res}c{col 55}{txt}Number of obs = {res}      2929
{txt}{hline 19}{c +}{hline 22}{col 55}Kernel        = {res}{ralign 10:Triangular}
{txt}{ralign 18:Number of obs}{col 19} {c |} {col 21}{res}     2735{col 34}      194{col 55}{txt}VCE method    = {res}{ralign 10:NN}
{txt}{ralign 18:Min of dist}{col 19} {c |} {col 21}{res}  -98.980{col 34}    0.179
{txt}{ralign 18:Max of dist}{col 19} {c |} {col 21}{res}   -0.233{col 34} 2561.831
{txt}{ralign 18:Order est. (p)}{col 19} {c |} {col 21}{res}        1{col 34}        1
{txt}{ralign 18:Order bias (q)}{col 19} {c |} {col 21}{res}        2{col 34}        2

Outcome: votes_share_08. Running variable: dist.
{txt}{hline 19}{c TT}{hline 30}{c TT}{hline 29}
{col 19} {c |} {col 30}BW est. (h){col 50} {c |} {col 60}BW bias (b)
{ralign 18:Method}{col 19} {c |} {col 22}Left of {res}c{col 40}{txt}Right of {res}c{txt}{col 50} {c |} {col 53}Left of {res}c{col 70}{txt}Right of {res}c
{txt}{hline 19}{c +}{hline 30}{c +}{hline 29}
{ralign 18:cerrd}{col 19} {c |} {col 22}{res}   16.254{col 41}   16.254{txt}{col 50} {c |} {col 51}{res}   46.508{col 71}   46.508
{txt}{hline 19}{c BT}{hline 30}{c BT}{hline 29}
(155 observations deleted)
(2,712 observations deleted)

Linear regression                               Number of obs     = {res}        62
                                                {txt}F(3, 16)          =  {res}     1.55
                                                {txt}Prob > F          = {res}    0.2411
                                                {txt}R-squared         = {res}    0.0455
                                                {txt}Root MSE          =    {res} 9.9304

{txt}{ralign 81:(Std. Err. adjusted for {res:17} clusters in state)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1} votes_share_04{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}fpcomplier {c |}{col 17}{res}{space 2}-5.012561{col 29}{space 2} 2.400003{col 40}{space 1}   -2.09{col 49}{space 3}0.053{col 57}{space 4}-10.10034{col 70}{space 3} .0752186
{txt}{space 11}dist {c |}{col 17}{res}{space 2} .3313989{col 29}{space 2} .2787428{col 40}{space 1}    1.19{col 49}{space 3}0.252{col 57}{space 4}-.2595095{col 70}{space 3} .9223072
{txt}dist_fpeligible {c |}{col 17}{res}{space 2}-.1227114{col 29}{space 2}  .408334{col 40}{space 1}   -0.30{col 49}{space 3}0.768{col 57}{space 4}-.9883408{col 70}{space 3}  .742918
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 52.11602{col 29}{space 2} 2.616906{col 40}{space 1}   19.92{col 49}{space 3}0.000{col 57}{space 4} 46.56843{col 70}{space 3} 57.66361
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}command {bf}outreg2{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do "C:\Users\UPE743~1\AppData\Local\Temp\STD1744_000000.tmp"
{txt}
{com}. *Replication of MS18_01854 (Economics Letters)
. *Authors: Christian Lehmann (corresponding author) and Hellen Matarazzo
. 
. /* Required STATA packages: 
> - "rdbwselect_2014" and "rdbwselect" must be installed to run this do-file. 
> - They can be downloaded at https://sites.google.com/site/rdpackages/rdrobust/stata (last accessed 17 Jan 2019) 
> - References: Calonico, S., Cattaneo, M. D., and R. Titiunik. 2014. Robust Data-Driven Inference in the Regression-DiscontinuityDesign. Stata Journal 14(4): 909-946, 4th Quarter 2014; Calonico, S., M. D. Cattaneo, M. H. Farrell, and R. Titiunik. 2016b. rdrobust: Software for Regression DiscontinuityDesigns.  Working Paper.  
> */
. 
. 
. /// preambule ///
> clear all
{res}{txt}
{com}. version 13.1
{txt}
{com}. set more off
{txt}
{com}. 
. 
. /// set directory ///
> 
. cd "C:\Users\up202000782\Downloads\ECOLET_18_01854_replication" // enter the directory where you put the (unzipped) replication folder "ECOLET_18_01854_replication"   
{res}C:\Users\up202000782\Downloads\ECOLET_18_01854_replication
{txt}
{com}. 
. 
. /// log file ///
> 
. capture log close
{smcl}
{com}{sf}{ul off}